<script setup>
import { ref, onMounted } from "vue";
import { useScormStore } from "../store/scormStore.js";
import Speech from "../components/Speech.vue";

const dataSpeech = ref([
  'Сплочённость группы в виде организации совместной деятельности и психологической безопасности способствует созданию благоприятной среды для обучения и развития каждого участника. ',
  'В таком случае, групповая динамика будет успешно проходить первые этапы и быстрее достигнет пика своей продуктивности. Применяя на практике описанные ранее советы – тренер самостоятельно может создать благоприятную атмосферу и необходимые условия для сплочённой групповой работы.',
  'На стадии расставания, когда тренинг подойдёт к концу – участники будут воодушевлены и благодарны за такой положительный опыт работы в группе и в будущем с большим энтузиазмом приступят к новому обучению.В таком случае, групповая динамика будет успешно проходить первые этапы и быстрее достигнет пика своей продуктивности. Применяя на практике описанные ранее советы – тренер самостоятельно может создать благоприятную атмосферу и необходимые условия для сплочённой групповой работы.\n',
])

</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
  </div>
</template>

<style scoped lang="scss">

</style>