<script setup>
import Slider from "../components/Slider.vue";
import Speech from "../components/Speech.vue";
import {ref} from "vue";

const dataSpeech = [
  'Тренер играет важную роль в поддержании профессиональных связей и личного уважения, обеспечивая плавное завершение проекта.',
]
const dataSlides = [
  {
    img: 'icon-5',
    title: 'Проведение сессии рефлексии',
    content: ['Тренер подводит заключительную обратную связь в свободной форме (например, созвон в Zoom), где участники могут поделиться своими мыслями, чувствами и полученным опытом. Например можно задать учащимся несколько вопросов: что нового сегодня узнал, чтобы хотелось в первую очередь попробовать применить на практике, когда это возможно сделать?   Этот этап помогает сохранить благоприятные взаимоотношения внутри группы, а значит, дальнейшее сотрудничество участников будет плодотворным.'],
  },
  {
    img: 'icon-5',
    title: 'Церемония признания вклада каждого участника',
    content: ['Тренер может организовать процесс поощрения и похвалы, где каждый член команды получит благодарность за свой вклад в проект. Это придаёт чувство значимости их усилиям, а значит, поддерживает сплочённость группы и включенность в процесс каждого участника.'],
  },
  {
    img: 'icon-5',
    title: 'Помощь в переходе',
    content: ['Тренер проявляет заботу о будущем участников, предоставляя информацию и ресурсы для их дальнейшего развития как профессионалов. Это помогает закрепить полученные знания, а так же, отработать приобретённые навыки. Тогда в следующий раз, команда будет организована из более опытных сотрудников, что напрямую повлияет на достижение поставленной цели.'],
  },
]

let show = ref(false);

setTimeout(() => {
  show.value = true;
}, 1000);

</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
    <p v-if="show" class="animate__animated animate__fadeIn mt-60 text-info">Нажимай на стрелки, чтобы перейти к следующему или предыдущему совету.</p>
    <slider v-if="show" class="animate__animated animate__slideInLeft" :slides-data="dataSlides"/>
  </div>
</template>

<style scoped lang="scss">

</style>


