<script setup>
import { ref, onMounted } from "vue";
import Speech from "../components/Speech.vue";
import CardFlip from "../components/CardFlip.vue";

const dataSpeech = ref([
  'Разберём оптимальные подходы.',
])

const dataFlipCard = ref([
  {
    title: 'Планирование времени',
    text: 'Необходимо заранее разработать расписание, учитывая продолжительность каждого упражнения, перерывы и обсуждения. Важно заложить «пустое» время, так как всегда что-то пойдет не так.',
    icon: 'icon-37-big',
    modal: {
      show: true,
      link: "Совет",
      title: "Совет по планированию времени",
      text: "<p>Поставь таймер и закрой глаза, не считая. Открой глаза, когда по ощущениям пройдет минута. Если глаза открыли раньше, значит, время будто бы бежит для человека и он, возможно, испытывает ощущение опоздания (возможно, это правда так и есть). Если глаза открыли позже, значит, время для человека тянется и на самом деле проходит быстрее, чем он ощущает.</p><p>Эти наблюдения помогут тебе в планировании. Если человек часто опаздывает или время для него ощущается дольше, чем на самом деле, нужно планировать с запасом. Если он ровно в пределах +/- 2-3 секунд, то планировать все равно нужно с запасом, но меньшим. Расписывать план нужно, проигрывая каждый момент: сколько времени займут цели, правила тренинга, инструктаж к игре, сама игра (каждая игра должна иметь ограничение по времени), насколько игру можно задержать, сколько будет занимать обратная связь после игр и упражнений и т.д.</p>"
    }
  },
  {
    title: 'Адаптация к потребностям',
    text: 'Важно учитывать реакции и эмоциональное состояние участников, чтобы адаптировать тайминг и сохранить их вовлеченность.',
    icon: 'icon-38-big',
    modal: {
      show: true,
      link: "Совет",
      title: "Совет по адаптации к потребностям",
      text: "Если участники устали, а впереди сложное упражнение, возможно, стоит сделать перерыв до упражнения. Если не успеваете и нет возможности задержаться, нужно определить, что наименее важно и пропустить это."
    }
  },
  {
    title: 'Управление переходами',
    text: "Сглаживание переходов между различными частями тренинга помогает поддерживать участников в фокусе и минимизировать потери времени..",
    icon: 'icon-39-big',
    modal: {
      show: true,
      link: "Совет",
      title: "Совет по управлению переходами",
      text: "Один раздел не должен резко прерываться и начинаться другой. В качестве плавных переходов можно использовать: интересные активности; после каждого блока – подводить небольшой итог; после завершения упражнений – обсудить полученные результаты и т.д."
    }
  },
])


</script>

<template>
  <div>
    <speech class="mt-35" :speech-data="dataSpeech" size="large"/>
    <p class="mt-25 text-info">Наведи на карточку чтобы узнать больше о роле тренера</p>
    <div class="row">
      <div v-for="(card, index) in dataFlipCard" :key="index">
        <card-flip :icon="card.icon" :title="card.title" :text="card.text" :modal="card.modal"/>
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
  .row {
    gap: 70px;
  }
</style>