<script setup>
import PickOne from "../components/PickOne.vue";

const question = 'Ты планируете обучающее мероприятие для вашей команды. Как вы будете подходить к планированию: включите самих участников в процесс, ориентируясь на их мнение о том, что им необходимо изучить для работы, или примете решение самостоятельно?';
const button = {
      correct: 'Включить самих участников',
      incorrect: 'Принять решение самостоятельно'
    };
const answer = {
      correct: 'Сообщить ученикам, что их мнение будет учтено. Благодаря этому, вовлеченность учеников в обучение будет выше, т.к. они поймут, что это обучение принесет им новые знания в той области, что им необходима.',
      incorrect: 'Может возникнуть риск недостаточного учета конкретных потребностей и интересов отдельных сотрудников, что может снизить эффективность обучения и уровень их вовлеченности и мотивации.'
    };
</script>

<template>
  <div>
    <h2>Принцип 1</h2>
    <p class="mt-60 text-info">Нажимай на стрелки, чтобы перейти к следующему или предыдущему совету.</p>
    <pick-one :question="question" :button="button" :answer="answer"  />
  </div>
</template>

<style scoped lang="scss">

</style>