<script setup>
import { ref, onMounted } from "vue";
import Speech from "../components/Speech.vue";
import Card from "../components/Card.vue";
import Tabs from "../components/Tabs.vue";

const dataSpeech = ref([
  'Давай подробнее разберём, как работают игры.',
])


const buttons = ["Ледоколы", "Ролевые игры", "Командные задачи", "Решение проблемм"];
const contents = [
  [
    {
      title: 'Цель:',
      text: 'Создание комфортной и дружеской атмосферы в группе, снятие напряжения и разогрев участников перед основной работой.'
    },
    {
      title: 'Примеры:',
      text: `
      <ul>
        <li>"Представьтесь и поделитесь фактом": Участники по очереди называют свои имена и рассказывают один интересный факт о себе.</li>
        <li>"Две правды и одна ложь": Каждый участник делает три утверждения о себе, из которых два правдивы, а одно ложное. Остальные должны угадать, что является ложью.</li>
        <li>"Круглый стол": Участники садятся в круг и по очереди отвечают на заданные вопросы, например, о последней прочитанной книге или любимом фильме.</li>
      </ul>
      `
    },
  ],
  [
    {
      title: 'Цель:',
      text: 'Отработка навыков в реальных или мнимых ситуациях, анализ поведения и реакций.'
    },
    {
      title: 'Примеры:',
      text: `
      <ul>
        <li>Импровизация ситуаций, связанных с профессиональной деятельностью (например, клиент-менеджер, конфликт на рабочем месте).</li>
        <li>Ролевые игры для тренировки навыков коммуникации, переговоров, управления конфликтами и т.д.</li>
      </ul>
      `
    },
  ],
  [
    {
      title: 'Цель:',
      text: 'Развитие сотрудничества, координации действий и работы в команде.'
    },
    {
      title: 'Примеры:',
      text: `
      <ul>
        <li>Построение конструкции из конструктора или материалов, требующее совместного участия всех членов группы.</li>
        <li>Решение логических или физических задач, требующее распределения ролей и совместного усилия.</li>
      </ul>
      `
    },
  ],
  [
    {
      title: 'Цель:',
      text: 'Развитие сотрудничества, координации действий и работы в команде.'
    },
    {
      title: 'Примеры:',
      text: `
      <ul>
        <li>Анализ случаев из реальной практики или выдуманных ситуаций, требующих выработки стратегии действий и выбора оптимального решения.</li>
        <li>Групповой обмен идеями и поиск консенсуса по сложным проблемам или задачам.</li>
      </ul>
      `
    },
  ],
]
</script>

<template>
  <div>
    <speech class="mt-25" :speech-data="dataSpeech" size="large"/>
    <p class="mt-25 text-info">Нажимай на роль, чтобы увидеть подробности.</p>
    <tabs :buttons="buttons" :contents="contents"/>
  </div>
</template>

<style scoped lang="scss">

</style>