<script setup>
import Speech from "../components/Speech.vue";
import {ref} from "vue";

const dataSpeech = [
  'Для успешного управления группой с минимальными затратами ресурсов важно понимать основные принципы взаимодействия в группе и обучения взрослых.',
  'В предыдущем модуле мы рассмотрели, какие стадии проходит группа. В этом модуле мы подробно рассмотрим основы обучения взрослых. И как они помогают держать групповую динамику в тонусе.',
  'Педагогика занимается обучением детей, в то время как <b>андрагогика</b> — обучением взрослых. Эти науки различаются из-за изменений восприятия и способностей с возрастом.'
]


let show = ref(false);

setTimeout(() => {
  show.value = true;
}, 1000);

</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
  </div>
</template>

<style scoped lang="scss">

</style>


