<script setup>
import Card from "../components/Card.vue";
import Slider from "../components/Slider.vue";
import {ref} from "vue";

const dataSlides = [
  {
    img: 'icon-34',
    title: 'Значение упражнений:',
    content: [
        `<ul>
            <li>Упражнения способствуют формированию командного духа, улучшению сотрудничества и координации действий в группе.</li>
            <li>Практические упражнения помогают участникам улучшать навыки эффективного общения, активного слушания и выражения своих мыслей.</li>
            <li>Некоторые упражнения направлены на тренировку лидерских навыков, таких как принятие решений, делегирование задач и мотивация команды.</li>
            <li>Упражнения способствуют созданию атмосферы доверия в группе, что важно для успешного совместного решения задач.</li>
        </ul>`
    ],
  },
  {
    img: 'icon-35',
    title: 'Советы по проведению упражнений:',
    content: [
      `<ul>
            <li>Выбирай упражнения, которые соответствуют целям тренинга и уровню участников.</li>
            <li>Предоставь возможность для обсуждения, чтобы обеспечить улучшение понимания и укрепление полученных знаний.</li>
            <li>Поддерживай уровень мотивации и включенности участников через их понимание значимости упражнений и достижения результатов.</li>
            <li>Обеспечивай обратную связь для каждого сотрудника и давай её сам.</li>
        </ul>`
    ],
  },
]
let sliderVisible = ref(false);

setTimeout(() => sliderVisible.value = true, 1000)
</script>

<template>
  <div>
    <h2 class="mt-35 mb-10">Игры</h2>
    <card class="slide-game__card mt-25 mb-10" text="Упражнение – это многократное выполнение специально разработанных действий или задач, направленных на развитие и совершенствование навыков участников." icon-position="left" />
    <slider v-if="sliderVisible" class="animate__animated animate__fadeInRight" :slides-data="dataSlides"/>
  </div>
</template>

<style lang="scss">
.slide-game__card {
  .card__text {
    margin-top: 0;
  }
}
</style>