<script setup>
import { ref } from 'vue';
import SpeechDialog from "../components/SpeechDialog.vue";

const dialogueData = [
  {
    question: "Прежде, чем мы продолжим, Влад, ответь мне на вопрос - что должен делать тренер: подстраивать материал под группу или группу под материал?",
    answers: [
      {
        text: "Материал под группу!",
        response: "Кажется, что материал под группу, ведь тренер может этим управлять.",
        next: 1,
      },
      {
        text: "Группу под материал!",
        response: "Кажется, группу под материал.",
        next: 2,
      },
    ],
  },
  {
    question: "Все верно! Тренер управляет материалом и адаптирует его под группу, чтобы участники получили конкретные инструменты и начали их применять. Важно понимать свою роль и комбинировать ее в течение тренинга для достижения всех целей программы.",
    answers: [
      {
        text: "Спасибо что обьяснил!",
        response: "Спасибо что обьяснил!",
        next: 3,
      },
    ],
  },
  {
    question: "Ты не прав! Тренер управляет материалом и адаптирует его под группу, чтобы участники получили конкретные инструменты и начали их применять. Важно понимать свою роль и комбинировать ее в течение тренинга для достижения всех целей программы.",
    answers: [
      {
        text: "Спасибо что обьяснил!",
        response: "Спасибо что обьяснил!",
        next: 3,
      },
    ],
  },
  {
    response: "Давай двигаться дальше.",
  },
];
</script>

<template>
  <div class="mt-25">
    <speech-dialog :dialogues="dialogueData"/>
  </div>
</template>

<style scoped lang="scss">
  .row {
    gap: 15px;
  }
</style>


