<script setup>
import SortableQuze from "../components/quze/SortableQuze.vue";
const task = 'Перед тобой типы участников. Соотнеси, к какому из типов  подходит каждый вариант.';
const questions = [
  {text: 'София – недавно в команде, а потому на тренинге предпочитает молчать и не проявлять инициативу, хотя при этом, она внимательно слушает и готова поддержать любую активность.', id: 1},
  {text: 'Алексей – тренер контент-менеджеров. На тренинге он временами может перебивать тренера, выражать своё несогласие и подчёркивать, что его подход к решению задачи – более эффективный. От него можно услышать фразы: «На самом деле, всё не совсем так», «Я знаю другой, более эффективный способ», «Я не совсем согласен, мне кажется…».', id: 2},
];
const answers = [
  {text: 'Цветочек', id: 1},
  {text: 'Критик', id: 2},
];
const feedback = {
  correct: ['Ты отлично справился и правильно соотнёс типы участников!'],
  incorrect: ['Ты ошибся, попробуй ещё раз!']
}
</script>

<template>
  <div>
    <sortable-quze :answers="answers" :questions="questions" :task="task" :feedback="feedback" size="large"/>
  </div>
</template>

<style scoped>
</style>
