<script setup>
import Speech from "../components/Speech.vue";

const dataSpeech = [
  'На стадии конфликта участники команды сталкиваются с разногласиями и противоречиями, что увеличивает эмоциональное напряжение и может снижать качество коммуникации.',
  'Причины конфликтов могут быть связаны с различиями в целях, методах работы или личных характеристиках.',
  'Управление этим этапом требует внимательного подхода к разрешению конфликтов и применения соответствующих стратегий.',
]
</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
  </div>
</template>

<style scoped>
</style>