<script setup>
import SortableQuze from "../components/quze/SortableQuze.vue";
const task = 'Сопоставь стадии развития группы с её описанием';
const questions = [
  {text: 'Тренер проводит тренинг для нового отдела, состоящего из сотрудников разных отделов, недавно объединённых для совместного проекта. Участники ещё не знакомы и только начинают понимать свои взаимодействия и роли в команде.', id: 1},
  {text: 'Тренер проводит тренинг для команды из десяти человек, работающих над крупным проектом в IT-компании. Возникают разногласия между разработчиками и тестировщиками относительно приоритетов и сроков, что приводит к напряжению и конфликтам.', id: 2},
  {text: 'Тренер работает с маркетинговым отделом компании, где недавно разрешили внутренние конфликты и выстроили роли в команде. Теперь команда готовится к новой стадии проекта и нуждается в усилении сотрудничества и эффективности работы.', id: 3},
  {text: 'Команда хорошо структурирована, её члены обладают высокой степенью автономии и способностью к самоорганизации. Отношения между участниками сильные и поддерживающие, они совместно работают над достижением проектных целей.', id: 4},
];
const answers = [
  {text: 'Формирующая', id: 1},
  {text: 'Конфликтная', id: 2},
  {text: 'Нормирующая', id: 3},
  {text: 'Стадия функционирования', id: 4}
];
const feedback = {
  correct: ['Ты отлично справился и правильно соотнёс все стадии развития!'],
  incorrect: ['Ты ошибся, попробуй ещё раз!']
}
</script>

<template>
  <div>
    <sortable-quze :answers="answers" :questions="questions" :task="task" :feedback="feedback"/>
  </div>
</template>

<style scoped>
</style>
