<script setup>
import Speech from "../components/Speech.vue";

const dataSpeech = [
  'На стадии расставания члены команды готовятся к завершению совместной работы, вызывающей разные эмоции — от грусти до радости от завершения проекта. ',
  'Если пренебречь этой стадией, то групповая динамика снизится на столько, что впечатления о проведённым времени за работой или обучением вместе негативно отразятся на возможной совместной работе в будущем.',
]
</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
  </div>
</template>

<style scoped>
</style>