<script setup>
import { ref, onMounted } from "vue";
import Speech from "../components/Speech.vue";

const dataSpeech = ref([
  'Напряженность группы можно рассматривать как противоположность сплочённости. Конфликты, стресс, негативное эмоциональное состояние, враждебность по отношению к другим участникам, раздражение – это лишь немногие из всех возможных проявлений напряжённости группы.',
  'Перед стартом тренинга перепроверить все доступные внешние факторы и своевременно реагировать на внешние. Например заранее продумать и протестировать как участники будут пользоваться материалами и как будут взаимодействовать друг с другом. Также необходимо писать сценарий тренинга, чтобы в том числе для себя продумать ход каждого упражнения.',
  'Если напряжение было снято – группа станет более сплочённой и включённой в процесс обучения.',
])

</script>

<template>
  <div>
    <speech class="mt-35" :speech-data="dataSpeech" size="large"/>
    <div class="slide__bg">
      <img width="1280" height="700" src="../assets/images/background/speech.png" alt="Фон слайда с оффисом Яндекс">
    </div>
  </div>
</template>

<style scoped lang="scss">

</style>