<script setup>
import Slider from "../components/Slider.vue";
import Speech from "../components/Speech.vue";
import {ref} from "vue";

const dataSpeech = [
  'Применение этих стратегий помогает тренеру поддерживать команду на стадии функционирования и способствует их долгосрочному успешному развитию.',
]
const dataSlides = [
  {
    img: 'icon-4',
    title: 'Поддержка и консультации',
    content: ['Тренер должен быть доступен для консультаций и помощи, не вмешиваясь в деятельность команды без необходимости. Это поддерживает самостоятельность и инициативность участников.\n' +
    'При таком взаимодействии группа не тратит ресурсы и время на долгий поиск решения, а обращается за поддержкой к тренеру.'],
  },
  {
    img: 'icon-4',
    title: 'Стимулирование инноваций и творческого подхода',
    content: ['Тренер может организовывать упражнения и игры в новых форматах, обогащая знания обучающихся нестандартными методами и поддерживая оригинальные идеи. В поддержании творческого подхода важно установить правило: никакой критики во время брейншторма. Это способствует рождению новых идей. Только перечисляя все подряд можно добраться до нового.'],
  },
  {
    img: 'icon-4',
    title: 'Продолжение обучения и профессионального развития',
    content: ['Обучение не должно ограничиваться представленным в презентации материалами. Побуждай к размышлению над решением более сложных вопросов и задач, с перспективой на будущее. Так, тренер предоставит возможность для активного участия группы в обучении, что повышает групповую динамику. Но не грузи участников сложными упражнениями, не забывай разбавлять сложные упражнения легкими.'],
  },
  {
    img: 'icon-4',
    title: 'Мониторинг и адаптивное управление процессами',
    content: ['Поддержание мотивации в виде: отмечание успехов, поощрений, празднование достижений каждого члена команды - поддерживает работоспособность группы и их желание продолжать дальше обучаться и работать на общий результат.  Важный момент в мотивации — перерывы. Не забывай каждый час устраивать перерыв на 10 минут.'],
  },
]

let show = ref(false);

setTimeout(() => {
  show.value = true;
}, 1000);

</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
    <p v-if="show" class="animate__animated animate__fadeIn mt-60 text-info">Нажимай на стрелки, чтобы перейти к следующему или предыдущему совету.</p>
    <slider v-if="show" class="animate__animated animate__slideInLeft" :slides-data="dataSlides"/>
  </div>
</template>

<style scoped lang="scss">

</style>


