<script setup>
import PickOne from "../components/PickOne.vue";

const question = 'Ты планируете обучающее мероприятие для вашей команды. Как вы будете подходить к планированию: включите самих участников в процесс, ориентируясь на их мнение о том, что им необходимо изучить для работы, или примете решение самостоятельно?';
const button = {
  correct: 'Включить самих участников',
  incorrect: 'Принять решение самостоятельно'
};
const answer = {
  correct: 'Вовлеченность положительно сказывается на групповой динамике, так как группа уже более-менее начинает ориентироваться в том, что предстоит пройти на обучении и какие могут быть ожидания со стороны тренера. Формирующая стадия пройдёт более гладко.',
  incorrect: 'В отличие от детей, взрослые способны осознавать их точки роста, поэтому, подключая их к процессу планирования, мы более точно определим запрос. Так же это будет большим плюсом для групповой динамики, ведь мы подходим к формирующей стадии группы, где будующие её участники уже формируют образ того, что им предстоит на обучении.'
};
</script>

<template>
  <div>
    <h2 class="mt-35">Принцип 1</h2>
    <p class="mt-25 text-info">Выберите правилльный ответ</p>
    <pick-one :question="question" :button="button" :answer="answer"  />
  </div>
</template>

<style scoped lang="scss">

</style>