<script setup>
import Slider from "../components/Slider.vue";
import Speech from "../components/Speech.vue";
import {ref} from "vue";

const dataSpeech = [
  'Мы формируем доверие и открытость участников. Без этого – ученик может занять саботирующую позицию и это затруднит последующие этапы работы.',
]
const dataSlides = [
  {
    img: 'icon-1',
    title: 'Признание присутствия конфликта',
    content: ['Тренер организует различные активности: smalltalk о погоде, кто из какого города (на момент подключения всех участников к конференции) и проводит мини-игры на знакомство (например: «две правды и одна ложь»). Так мы снимаем неловкость и мотивируем участников к включенности.'],
  },
  {
    img: 'icon-1',
    title: 'Введение в роли и ответственности',
    content: ['При необходимости – проводим жеребьёвки, мозговые штурмы для распределения ролей между участниками. Так, у каждого формируется представление о том, за что он несёт ответственность. Например с помощью жеребьёвки разыгрываем темы для создания презентаций.'],
  },
  {
    img: 'icon-1',
    title: 'Установление правил взаимодействия',
    content: ['Чтобы облегчить дальнейшую работу в команде, тренер помогает участникам сформулировать основные правила и нормы поведения в команде.'],
  },
  {
    img: 'icon-1',
    title: 'Проведение несложного совместного задания',
    content: ['Тренер делегирует команде простое задание, которое они должны выполнить вместе. Это упражнение направлено на формирование первоначального сотрудничества и взаимопонимания между участниками. Совместное задание – поддерживает групповую динамику, т.к. развивает сплочённость участников.'],
  },
  {
    img: 'icon-1',
    title: 'Обсуждение ожиданий и целей',
    content: ['Стоит спросить у участников об их ожиданиях от тренинга, какого результата они хотят достичь. Цель – это всегда результат. Если цель не ясна – групповая динамика снизится и результат обучения будет непредсказуемым.'],
  },
]

let show = ref(false);

setTimeout(() => {
  show.value = true;
}, 1000);

</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
    <p v-if="show" class="animate__animated animate__fadeIn mt-60 text-info">Нажимай на стрелки, чтобы перейти к следующему или предыдущему совету.</p>
    <slider v-if="show" class="animate__animated animate__slideInLeft" :slides-data="dataSlides"/>
  </div>
</template>

<style scoped lang="scss">

</style>


