<script setup>
import { ref, onMounted } from "vue";
import { useScormStore } from "../store/scormStore.js";
import Card from "../components/Card.vue";

const dataSpeech = ref([
  'Мы разобрали структуру группы, давайте перейдем к обсуждению факторов, которые помогают сплотить участников. Рассмотрим, как совместная деятельность, психологическая безопасность и единые цели могут укрепить группу и повысить эффективность обучения.',
])

const scormStore = useScormStore();
const selectedCharacter = ref('girl');
const dataCards = ref([
  {
    icon: 'icon-20',
    title: 'Доверие',
    text: 'Участники уверены друг в друге и не боятся открыто выражать свои мысли и чувства.',
    visible: false,
    modal: {
      show: true,
      linkTitle: 'Действия тренера',
      title: 'Доверие',
      text:  `<ol><li>Начни тренинг с теплого приветствия и подчеркивание ценности каждого участника.</li><li>Проведи упражнение на знакомство, которые помогают снизить начальное напряжение и построить первый уровень комфорта и неформальной связи.</li></ol>`
    }
  },
  {
    icon: 'icon-21',
    title: 'Ролевые игры',
    text: 'Все члены группы могут свободно делиться идеями и мнениями без опасений.',
    visible: false,
    modal: {
      show: true,
      linkTitle: 'Действия тренера',
      title: 'Открытость',
      text:  `<ol><li>Организуй активности, где участники делятся личными историями или мнениями по заданной теме. Это способствует глубокому взаимопониманию и поддержке в команде.</li></ol>`
    }
  },
  {
    icon: 'icon-22',
    title: 'Мозговые штурмы',
    text: 'Ошибки воспринимаются как возможность для обучения и роста.',
    visible: false,
    modal: {
      show: true,
      linkTitle: 'Действия тренера',
      title: 'Доверие',
      text:  `<ol>
<li>Прежде всего, объясни участникам ценность ошибок как возможности для обучения и развития. Определи и согласуй термины "ошибка" и "обучающий момент" среди всех участников.</li>
<li>Подчеркни, что ошибки не будут использоваться в качестве критики личности, но как шанс для роста. Важно установить атмосферу, где участники не боятся делиться и обсуждать свои ошибки.</li>
<li>В процессе обсуждения ошибок используй объективную лексику и избегай личных оценок. Подчеркивай фактические данные и обстоятельства, приведшие к ошибке. Тренер обучает и применяет методики конструктивной критики, такие как метод "сэндвича" (положительный комментарий, затем критика, завершающийся еще одним положительным комментарием).</li>
<li>После того как ошибка обсуждена, направляй дискуссию на поиск решений и предложений улучшений. Это переводит акцент с самой ошибки на процесс улучшения и предотвращения подобных ошибок в будущем.</li>
<li>Помогай участникам в разработке индивидуальных или командных планов действий на основе обсуждений ошибок, с конкретными шагами по предотвращению повторения ошибок и стратегиями улучшения работы.</li>
<li>Оказывай поддержку и мотивацию участникам, подчеркивая успехи в личном и профессиональном обучении.</li>
</ol>`
    }
  },
]);
const dataCards2 = ref([
  {
    icon: 'icon-23',
    title: 'Конструктивный фидбэк',
    text: 'Обратная связь направлена на улучшение и развитие, а не на критику.',
    visible: false,
    modal: {
      show: true,
      linkTitle: 'Действия тренера',
      title: 'Конструктивный фидбэк',
      text:  `<ol>
<li>Используй интерактивные форматы, например, круглый стол или дебаты, где каждому участнику предоставляется время для высказывания своих идей и мнений по обсуждаемой теме.</li>
<li>Задавай вопросы, которые требуют развернутого ответа, а не "да" или "нет". Например, "Как ты считаешь, какие стратегии могут помочь в решении данной проблемы?"</li>
<li>Используй графические методы, например, записи идей каждого участника на доске или флипчарте. Это позволяет участникам видеть, что их мнения учтены и оценены.</li>
<li>Активно поощряй и поддерживай участников за их вклад. Позитивное подкрепление через благодарности или небольшие поощрительные награды может мотивировать участников быть более активными и открытыми.</li>
</ol>`
    }
  },
  {
    icon: 'icon-24',
    title: 'Возможность высказывать свое мнение',
    text: 'Каждый участник имеет право голоса и его мнение ценится.',
    visible: false,
    modal: {
      show: true,
      linkTitle: 'Действия тренера',
      title: 'Возможность высказывать свое мнение',
      text:  `<ol>
<li>Включай активности, которые развивают понимание и эмпатию между участниками. Например, упражнения на перестановку ролей, где участники выступают в роли своих коллег, делясь потенциальными вызовами и чувствами.</li>
<li>Показывай, как адекватно реагировать на критику и различные мнения, снимая напряженность и возможные страхи у участников. Это включает техники активного слушания и конструктивного отклика.</li>
<li>Обеспечивай возможность высказаться, особенно тем, кто склонен молчать. Используй методы, такие как круговой опрос или чередование говорящих, помогает вовлечь всех без исключения.</li>
<li>Регулярно предлагай индивидуальную поддержку участникам, которые испытывают особые трудности в выражении своих мыслей или сталкиваются с препятствиями в общении.</li>
</ol>`
    }
  },
  {
    icon: 'icon-25',
    title: 'Общение без страха',
    text: 'Возможность общаться с коллегами без страха быть осужденным или негативно оцененным.',
    visible: false,
  },
]);

onMounted(() => {
  const savedCharacter = scormStore.getCustomData('selectedCharacter');
  if (savedCharacter) {
    selectedCharacter.value = savedCharacter;
  }

  let timeOut = 1000;

  for (let card of dataCards.value) {
    setTimeout(() => {
      card.visible = true;
    }, timeOut);

    timeOut += 500;
  }
  for (let card of dataCards2.value) {
    setTimeout(() => {
      card.visible = true;
    }, timeOut);

    timeOut += 500;
  }
});
</script>

<template>
  <div>
    <h2 class="mt-35">Психологическая безопасность</h2>
    <card
        animate-class="animate__fadeInRight"
        class="mt-25"
        icon-position="left"
        text="Психологическая безопасность — это состояние, при котором человек чувствует себя защищенным, уважаемым и принятым в коллективе."
    />
    <div class="row mt-25">
      <div style="width: 33%" v-for="(card, index) in dataCards" :key="index">
        <card
            v-if="card.visible"
            :icon="card.icon"
            :title="card.title"
            :text="card.text"
            icon-position="left"
            :modal="card.modal"
        >
        </card>
      </div>
    </div>
    <div class="row mt-25">
      <div style="width: 33%" v-for="(card, index) in dataCards2" :key="index">
        <card
            v-if="card.visible"
            :icon="card.icon"
            :title="card.title"
            :text="card.text"
            icon-position="left"
            :modal="card.modal"
        >
        </card>
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
  .row {
    gap: 20px;
  }
</style>