<script setup>
import SortableQuze from "../components/quze/SortableQuze.vue";
const task = 'Сопоставь структуру группы с её описанием.';
const questions = [
  {text: 'В начале тренинга тренер просит участников самостоятельно выбрать лидера для координации групповой работы. Лидер начинает делегировать обязанности остальным участникам, исходя из своих представлений о компетенциях и опыте участников.', id: 1},
  {text: 'Каждый участник приглашается высказать свое мнение и предложить идеи. Роль лидера в команде не фиксирована и может меняться, что позволяет каждому участнику принять на себя инициативу. По завершении тренинга собираются обратные связи от всех участников. ', id: 2},
];
const answers = [
  {text: 'Иерархическая', id: 1},
  {text: 'Демократическая', id: 2},
];
const feedback = {
  correct: ['Ты отлично справился и правильно соотнёс структуру группы с её описание!'],
  incorrect: ['Ты ошибся, попробуй ещё раз!']
}
</script>

<template>
  <div>
    <sortable-quze :answers="answers" :questions="questions" :task="task" :feedback="feedback" size="large"/>
  </div>
</template>

<style scoped>
</style>
