<script setup>
import Slider from "../components/Slider.vue";
import Speech from "../components/Speech.vue";

const dataSpeech = [
  'Действия тренера на этой стадии направлены на создание основы для доверия, открытости и сотрудничества в команде, что существенно облегчает последующие этапы работы.',
]
const dataSlides = [
  {
    img: 'icon-1',
    title: 'Проведение знакомительных упражнений',
    content: ['Тренер организует серию активностей, чтобы помочь участникам узнать друг друга на профессиональном и личном уровне. Пример упражнения: "Две правды и одна ложь", где каждый участник рассказывает три утверждения о себе, а остальные должны угадать, какое из них неправдиво.'],
  },
  {
    img: 'icon-1',
    title: 'Обсуждение ожиданий и целей',
    content: ['Тренер задает вопросы команде о их ожиданиях от тренинга и проекта, а также о личных целях каждого участника. Это помогает ориентировать их на общие и индивидуальные задачи.'],
  },
]
</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech"/>
    <p class="mt-60 text-info">Нажимай на стрелки, чтобы перейти к следующему или предыдущему совету.</p>
    <slider class="" :slides-data="dataSlides"/>
  </div>
</template>

<style scoped lang="scss">

</style>


