<script setup>
import Speech from "../components/Speech.vue";

const dataSpeech = [
  'На стадии функционирования команда демонстрирует повышенную эффективность и продуктивность. ',
  'Установлены стандарты работы и ожидаемые нормы поведения, что снижает уровень конфликтов и улучшает кооперацию между её членами.',
  'Нормализация становится переходом от разрешения конфликтов к оптимизации рабочих процессов и углублению командных взаимоотношений.',
]
</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
  </div>
</template>

<style scoped>
</style>