<script setup>
import { ref, onMounted } from "vue";
import Speech from "../components/Speech.vue";

const dataSpeech = ref([
  'Структура группы задаёт общие правила взаимодействия её участников. Если подобрать неверный тип структуры для достижения определённой цели, это может резко снизить продуктивность. ',
  'Например, на этапе формирования группы лучше использовать иерархическую структуру, где тренер выступает в роли лидера, объясняет правила, цели и задачи тренинга, а также распределяет роли и зоны ответственности среди участников.',
  'А на этапе конфликта можно внедрить демократическую структуру, позволив участникам активно участвовать в творческом мозговом штурме и предлагать решения проблем.',
])

</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>

    <div class="slide__bg">
      <img width="1280" height="700" src="../assets/images/background/speech.png" alt="Фон слайда с оффисом Яндекс">
    </div>
  </div>
</template>

<style scoped lang="scss">

</style>