<script setup>
import PickOne from "../components/PickOne.vue";

const question = 'Ты — разработчик учебных программ в компании и ответственен за создание эффективной учебной программы для учеников. Твоей целевой аудиторией являются взрослые, которые учатся через собственный опыт. Какой подход использовать в качестве основы для обучающей программы?';
const button = {
  correct: 'Готовые кейсы с ответами',
  incorrect: 'Предлагать проблемы, а не готовые решения'
};
const answer = {
  correct: 'В андрагогике мы подталкиваем ученика к самостоятельности и размышлению, развиваем его лидерские качества. Взрослые ориентированы на получение тех знаний, которые помогут им решить текущие проблемы, они в большей степени ориентированы на практическое применение новых навыков. Если же предоставить готовые кейсы с ответами, то группа рискует стать максимально разобщённой и даже распасться, поскольку её участники не будут заинтересованы в обучении.',
  incorrect: 'В андрагогике мы подталкиваем ученика к самостоятельности и размышлению, развиваем его лидерские качества. Если мы предоставляем готовые кейсы с ответами, то условно возвращаем обучающегося в школу, где его задача была не развивать аналитическое мышление, а запоминать ту информацию, которую дают учителя. При таком подходе, группа рискует стать максимально разобщённой и даже распасться, поскольку её участники не будут заинтересованы в обучении.'
};
</script>

<template>
  <div>
    <h2 class="mt-35">Принцип 4</h2>
    <p class="mt-25 text-info">Выберите правилльный ответ</p>
    <pick-one :question="question" :button="button" :answer="answer"  />
  </div>
</template>

<style scoped lang="scss">

</style>