<script setup>
import Speech from "../components/Speech.vue";

const dataSpeech = [
  'Если прошлые две стадии были успешно пройдены, то команда достигает высокой степени координации и организованности. Это и есть стадия нормализации.',
  'Теперь члены команды максимально быстро и эффективно выполняет поставленные задачи.',
  'Всё это, а так же взаимное доверие и открытость – помогает группе успешно продвигаться к поставленной цели.',
]
</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
  </div>
</template>

<style scoped>
</style>