<script setup>
import Slider from "../components/Slider.vue";
import Speech from "../components/Speech.vue";
import {ref} from "vue";

const dataSpeech = [
  'Важно, чтобы тренер сохранял нейтральность и поощрял конструктивный подход в процессе обсуждения разногласий. Профессиональное управление конфликтами не только способствует разрешению проблем, но и укрепляет команду.',
]
const dataSlides = [
  {
    img: 'icon-2',
    title: 'Признание присутствия конфликта',
    content: ['Тренер должен признать конфликт и вынести его на открытое обсуждение. Мозговой штурм – отличный метод для совместного поиска решения. Можно преподнести это так: «Давайте вместе подумаем, как можно решить эту задачу. Коля, как бы ты поступил в этой ситуации?».'],
  },
  {
    img: 'icon-2',
    title: 'Фасилитация открытого диалога',
    content: ['Тренер предоставляет инструменты для конструктивного выражения критики. Например сбор обратной связи после упражнения. Отличный способ – сообщить свою точку зрения через «Я-концепция» (например, "Я чувствую, что… »). Если пренебрегать этим, могут возникнуть личная неприязнь между участниками. Тогда групповая динамика резко снизится и потребуется дополнительные ресурсы для восстановления атмосферы в группе.'],
  },
  {
    img: 'icon-2',
    title: 'Анализ корней проблемы',
    content: ['Важно разобраться в настоящей причине конфликта. Для этого, тренер может задавать уточняющие вопросы участникам, например: «Даниил, подскажи, ты переживаешь за то, что тебе не хватило времени для тестового задания и ты недоволен результатом?».'],
  },
  {
    img: 'icon-2',
    title: 'Обучение методам разрешения конфликтов',
    content: ['Тренер на примере открытого обсуждения показывает, как можно учитывать разный взгляд людей на одну и ту же проблему, расхождение в интересах, ценностях и целях. Универсальная стратегия решения конфликта в группе: найти общее, что объединяет группу и поиск совместного решения через конструктивный диалог, уточняющие вопросы и «Я-концепция».'],
  },
  {
    img: 'icon-2',
    title: 'Работа над согласием',
    content: ['Прежде чем вынести итоговое решение – его нужно ещё раз озвучить группе и запросить обратную связь. Важно, чтобы участники единогласно согласились с решением. Если какая-то сторона осталась недовольна – то, в групповой динамике появится отстранённость участников от процесса обучения.'],
  },
  {
    img: 'icon-2',
    title: 'Восстановление отношений',
    content: ['Тренер может зафиксировать соглашение (например, прописать новые правила в  чат обучения), проговорить о формате взаимодействия участников в дальнейшем, в соответствии с принятым решением. Например это может быть открытое обсуждение формата взаимодействия в дальнейшем.'],
  },
]

let show = ref(false);

setTimeout(() => {
  show.value = true;
}, 1000);

</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
    <p v-if="show" class="animate__animated animate__fadeIn mt-60 text-info">Нажимай на стрелки, чтобы перейти к следующему или предыдущему совету.</p>
    <slider v-if="show" class="animate__animated animate__slideInLeft" :slides-data="dataSlides"/>
  </div>
</template>

<style scoped lang="scss">

</style>


