<script setup>
import { ref, onMounted } from "vue";
import Speech from "../components/Speech.vue";
import Accordion from "../components/Accordion.vue";

const dataSpeech = ref([
  'Мы изучили факторы сплоченности и напряжённости группы, дам тебе несколько советов а потом перейдем к следующему разделу.',
])

const dataAccordion = ref([
  {
    title: 'Что тренеру следует учитывать до начала тренинга',
    text: `
    <ol class="mb-10">
      <li>Составить грамотный сценарий тренинга, в котором прописать все этапы, планируемое время для каждого раздела и учитывать время на перерыв.</li>
      <li>Заранее проверить оборудование, доступность материалов.</li>
      <li>Запланировать время на отдых. Перерыв оптимально проводить по 10 минут через каждый час занятия.</li>
      <li>Заблаговременно узнать целевую аудиторию: кто будет участником тренинга, какой у них опыт, какие есть ожидание и пр.</li>
      <li>Подготовить план «Б» – как реагировать и как вести тренинг на случай непредвиденных обстоятельств и/или возникновения конфликта между участниками. Это поможет тебе оперативно среагировать в стрессовой ситуации.</li>
    </ol>
    <p>Это практические советы, которые помогут тренеру предотвратить возможность возникновения внешних факторов напряжённости.</p>
    `
  },
  {
    title: 'Что делать тренеру, если заметил напряженность во время тренинга',
    text: `
    <ol class="mb-10">
      <li>В случае возникновения конфликта – организовать пространство для конструктивного обсуждения проблемы.</li>
      <li>Открыто делиться своими предположениями о том, что как вам кажется, вызывает напряжение в группе и запросить обратную связь.</li>
      <li>Если напряжённость вызвана перегрузкой информацией – лучше чередовать с весёлыми активностями. Можно так же, в общей беседе выделить 5-10 минут на обсуждение отвлечённой темы (домашние питомцы, хобби и пр. - темы которые часто подниимают настроение и помогают расслабиться).  Ну и конечно важно чередовать сложные упражнения с более легкими, чтобы у группы была возможность «Выдохнуть»</li>
      <li>Позволить внедрить лёгкий юмор для разрядки обстановки. Здесь можно прибегнуть к помощи участника, который занимает роль юмориста.</li>
      <li>Признать возможные ошибки в просчётах при планировании и проведении тренинга, которые стали причинами напряженности.</li>
    </ol>
    <p>Это практические советы, которые помогут тренеру предотвратить возможность возникновения внутренних факторов напряжённости.</p>
    `
  },
])

</script>

<template>
  <div>
    <speech class="mt-25" :speech-data="dataSpeech" size="large"/>
    <p class="mt-25 text-info">Нажимай на совет, чтобы раскрыть его.</p>
    <accordion :items="dataAccordion"/>
  </div>
</template>

<style scoped lang="scss">

</style>