<script setup>
import Slider from "../components/Slider.vue";
import Speech from "../components/Speech.vue";
import {ref} from "vue";

const dataSpeech = [
  'На этой стадии тренер играет ключевую роль в поддержании фокуса команды на общих целях и постоянном улучшении внутрикомандных отношений и рабочих процессов.',
]
const dataSlides = [
  {
    img: 'icon-3',
    title: 'Укрепление ролей и ответственностей',
    content: ['Тренер отслеживает, кто из участников какую роль занимает и как это отражается на работе в команде. Если он заметил негативные изменения в групповой динамике, например, снизилась скорость работы, то он может вынести этот вопрос на открытое обсуждение и утонить у команды, чего им не хватает или что нужно изменить.'],
  },
  {
    img: 'icon-3',
    title: 'Фокусировка на постановке целей и планировании',
    content: ['Тренер помогает формулировать цели и задачи в каждом упражнении. Для этого он кратко и понятно, совместно с группой, разрабатывает план, устанавливает сроки исполнения.  Это позволяет поддерживать продуктивность группы и темп работы, фокусируя их внимание на самом важном.'],
  },
  {
    img: 'icon-3',
    title: 'Поддержка дисциплины и сплочённости',
    content: ['Тренер занимает позицию наблюдателя. Перед ним стоит задача – следить чтобы правила группы и нормы взаимодействия соблюдались всеми участниками. Это помогает минимизировать конфликты и поддерживает благоприятную психологическую среду для эффективного обучения.'],
  },
  {
    img: 'icon-3',
    title: 'Ориентация сотрудников на ценности компании',
    content: ['Общее взаимодействие группы должно отражать основные ценности корпоративной культуры. Поскольку, они хорошо известны участникам – часть правил на тренинге будет соблюдаться по умолчанию.'],
  },
  {
    img: 'icon-3',
    title: 'Оценка и обратная связь',
    content: ['Тренеру важно собирать обратную связь от членов команды. Она помогает своевременно реагировать на изменения в групповой динамике, тем самым, позволяет поддерживает сплочённость участников и их эффективность.'],
  },
  {
    img: 'icon-3',
    title: 'Празднование достижений',
    content: ['Тренеру важно отмечать успехи команды. Ты можешь как хвалить и давать конструктивную обратную связь, так и поощрять положительные результаты участника (например, через геймификацию можно получить ачивку/бонус/ранг и т.д.). Если достижения воспринимать как само собой разумеющееся – мотивация группы снизится, участники в меньшей степени будут ориентироваться на результат.'],
  },
]

let show = ref(false);

setTimeout(() => {
  show.value = true;
}, 1000);

</script>

<template>
  <div>
    <speech class="mt-60" :speech-data="dataSpeech" size="large"/>
    <p v-if="show" class="animate__animated animate__fadeIn mt-60 text-info">Нажимай на стрелки, чтобы перейти к следующему или предыдущему совету.</p>
    <slider v-if="show" class="animate__animated animate__slideInLeft" :slides-data="dataSlides"/>
  </div>
</template>

<style scoped lang="scss">

</style>


