<script setup>
import PickOne from "../components/PickOne.vue";

const question = 'Ты — разработчик учебных программ в компании и ответственен за создание эффективной учебной программы для учеников. Твоей целевой аудиторией являются взрослые, которые учатся через собственный опыт. Какой подход использовать в качестве основы для обучающей программы?';
const button = {
  correct: 'Использование практических знаний и навыков обучающихся',
  incorrect: 'Теоретическая часть'
};
const answer = {
  correct: 'Принцип основан на активных методах обучения, стимулирующих творческую работу обучающихся. заключается и в диалоге каждого участника  с тренером, направленная на взаимную передачу информаций и знаний. К тому же, такой подход помогает группе быстрее совершить переход из нормирующей стадии к стадии функционирования.',
  incorrect: 'Если материал обучения оторван от реальности (не включает себя жизненный опыт, текущие знания и навыки учеников), то он так и остаётся теорией, которая снижает интерес, вовлеченность учеников. Так, группа рискует оказаться в зоне конфликта, где её участники будут «выпадать» и/или саботировать  процесс обучения.'
};
</script>

<template>
  <div>
    <h2 class="mt-35">Принцип 3</h2>
    <p class="mt-25 text-info">Выберите правилльный ответ</p>
    <pick-one :question="question" :button="button" :answer="answer"  />
  </div>
</template>

<style scoped lang="scss">

</style>