<script setup>
import SortableQuze from "../components/quze/SortableQuze.vue";
const task = 'Перед тобой типы участников. Соотнеси, к какому из типов  подходит каждый вариант.';
const questions = [
  {text: 'Анна – менеджер проектов, с опытом работы более 10 лет. На тренинге она одна из первых отвечает на вопросы, проявляет инициативность в процессе обсуждения и помогает другим участникам группы сориентироваться в практических заданиях.', id: 1},
  {text: 'Игорь – сотрудник из отдела маркетинга. На тренинге он проявляет своё остроумие, не боится шутить и тем самым часто привлекает к себе внимание коллег. С ним приятно и легко общаться, он поддерживает положительную атмосферу в команде, но иногда может отвлекать от процесса обучения.', id: 2},
  {text: 'Елена – ведущий аналитик, она целеустремлённая и занимает активную позицию. На тренинге она часто делится своим опытом, знаниями, старается делиться информацией с другими участниками, и это может несколько замедлять тем обучения всей группы. Зато она действительно хорошо осведомлена в теме и ей легче даётся обучение.', id: 3},
];
const answers = [
  {text: 'Лидер', id: 1},
  {text: 'Юморист', id: 2},
  {text: 'Эксперт', id: 3},
];
const feedback = {
  correct: ['Ты отлично справился и правильно соотнёс типы участников!'],
  incorrect: ['Ты ошибся, попробуй ещё раз!']
}
</script>

<template>
  <div>
    <sortable-quze :answers="answers" :questions="questions" :task="task" :feedback="feedback" size="large"/>
  </div>
</template>

<style scoped>
</style>
