<script setup>
import SortableQuze from "../components/quze/SortableQuze.vue";
const task = 'Сопоставь роль тренера с описанием';
const questions = [
  {text: 'Тренер четко формулирует ожидания от участников, подчеркивая необходимость активного участия и вовлечения в процесс обучения. Создает планы развития, адаптированные под специфические потребности разных команд.', id: 1},
  {text: 'Тренер организует тренинг, где каждый участник, включая самого тренера, может высказывать мнение и предлагать идеи по теме обсуждения. В ролевых играх, моделирующих рабочие ситуации, тренер принимает роль наравне с остальными участниками. ', id: 2},
  {text: 'Тренер замечает, что команда или отдельные участники сталкиваются с трудностями, он временно прерывает тренинг для инструктажа или предоставления совета. Дает уверенность членов команды в их способностях на протяжении всего тренинга.', id: 3},
];
const answers = [
  {text: 'Лидер', id: 1},
  {text: 'Равный', id: 2},
  {text: 'Спасатель', id: 3},
];
const feedback = {
  correct: ['Ты отлично справился и правильно соотнёс роли тренера!'],
  incorrect: ['Ты ошибся, попробуй ещё раз!']
}
</script>

<template>
  <div>
    <sortable-quze :answers="answers" :questions="questions" :task="task" :feedback="feedback"/>
  </div>
</template>

<style scoped>
</style>
