import{C as a}from"./Card-BwOpG-jj.js";import{_ as l}from"./Slider-COR50kFT.js";import{r as s,a as o,d as r,l as c,j as m,f as n,b as _,o as t}from"./index-BZGghEaE.js";/* empty css                                                             */import"./Slider.vue_vue_type_style_index_0_lang-CAxzyRbH.js";const d=_("h2",{class:"mt-35 mb-10"},"Игры",-1),V={__name:"page-61",setup(u){const i=[{img:"icon-34",title:"Значение упражнений:",content:[`<ul>
            <li>Упражнения способствуют формированию командного духа, улучшению сотрудничества и координации действий в группе.</li>
            <li>Практические упражнения помогают участникам улучшать навыки эффективного общения, активного слушания и выражения своих мыслей.</li>
            <li>Некоторые упражнения направлены на тренировку лидерских навыков, таких как принятие решений, делегирование задач и мотивация команды.</li>
            <li>Упражнения способствуют созданию атмосферы доверия в группе, что важно для успешного совместного решения задач.</li>
        </ul>`]},{img:"icon-35",title:"Советы по проведению упражнений:",content:[`<ul>
            <li>Выбирай упражнения, которые соответствуют целям тренинга и уровню участников.</li>
            <li>Предоставь возможность для обсуждения, чтобы обеспечить улучшение понимания и укрепление полученных знаний.</li>
            <li>Поддерживай уровень мотивации и включенности участников через их понимание значимости упражнений и достижения результатов.</li>
            <li>Обеспечивай обратную связь для каждого сотрудника и давай её сам.</li>
        </ul>`]}];let e=s(!1);return setTimeout(()=>e.value=!0,1e3),(f,p)=>(t(),o("div",null,[d,r(a,{class:"slide-game__card mt-25 mb-10",text:"Упражнение – это многократное выполнение специально разработанных действий или задач, направленных на развитие и совершенствование навыков участников.","icon-position":"left"}),c(e)?(t(),m(l,{key:0,class:"animate__animated animate__fadeInRight","slides-data":i})):n("",!0)]))}};export{V as default};
