import{S as m}from"./Speech-DyRS80ZA.js";import{_ as h,c as u,o,a,F as f,m as v,b as l,i as x,t as g,d as n,S as w,n as S,x as y,l as k,r as d}from"./index-DO_ee_GA.js";import"./character-ivan-speech-CdQ9LzjO.js";/* empty css                                                               */const A={class:"accordion"},b=["onClick"],z=["innerHTML"],B={__name:"Accordion",props:{items:{type:Array,default:[{title:"Заголовок",text:"Текст",show:!1}]}},setup(r){const i=r;let t=u(()=>[...i.items]);function _(s){for(let c of t.value)c.show&&(c.show=!1);s.show=!s.show}return(s,c)=>(o(),a("div",A,[(o(!0),a(f,null,v(k(t),(e,p)=>(o(),a("div",{class:"accordion__item",key:p},[l("div",{class:S(["accordion__header",e.show?"accordion__header_active":""]),onClick:L=>_(e)},[x(g(e.title)+" ",1),n(w,{name:"arrow"})],10,b),l("div",{style:y({height:e.show?"100%":0}),class:"accordion__container"},[l("div",{class:"accordion__content",innerHTML:e.text},null,8,z)],4)]))),128))]))}},C=h(B,[["__scopeId","data-v-76f30718"]]),I=l("p",{class:"mt-25 text-info"},"Нажимай на совет, чтобы раскрыть его.",-1),F={__name:"page-57",setup(r){const i=d(["Мы изучили факторы сплоченности и напряжённости группы, дам тебе несколько советов а потом перейдем к следующему разделу."]),t=d([{title:"Что тренеру следует учитывать до начала тренинга",text:`
    <ol class="mb-10">
      <li>Составить грамотный сценарий тренинга, в котором прописать все этапы, планируемое время для каждого раздела и учитывать время на перерыв.</li>
      <li>Заранее проверить оборудование, доступность материалов.</li>
      <li>Запланировать время на отдых. Перерыв оптимально проводить по 10 минут через каждый час занятия.</li>
      <li>Заблаговременно узнать целевую аудиторию: кто будет участником тренинга, какой у них опыт, какие есть ожидание и пр.</li>
      <li>Подготовить план «Б» – как реагировать и как вести тренинг на случай непредвиденных обстоятельств и/или возникновения конфликта между участниками. Это поможет тебе оперативно среагировать в стрессовой ситуации.</li>
    </ol>
    <p>Это практические советы, которые помогут тренеру предотвратить возможность возникновения внешних факторов напряжённости.</p>
    `},{title:"Что делать тренеру, если заметил напряженность во время тренинга",text:`
    <ol class="mb-10">
      <li>В случае возникновения конфликта – организовать пространство для конструктивного обсуждения проблемы.</li>
      <li>Открыто делиться своими предположениями о том, что как вам кажется, вызывает напряжение в группе и запросить обратную связь.</li>
      <li>Если напряжённость вызвана перегрузкой информацией – лучше чередовать с весёлыми активностями. Можно так же, в общей беседе выделить 5-10 минут на обсуждение отвлечённой темы (домашние питомцы, хобби и пр. - темы которые часто подниимают настроение и помогают расслабиться).\u2028 Ну и конечно важно чередовать сложные упражнения с более легкими, чтобы у группы была возможность «Выдохнуть»</li>
      <li>Позволить внедрить лёгкий юмор для разрядки обстановки. Здесь можно прибегнуть к помощи участника, который занимает роль юмориста.</li>
      <li>Признать возможные ошибки в просчётах при планировании и проведении тренинга, которые стали причинами напряженности.</li>
    </ol>
    <p>Это практические советы, которые помогут тренеру предотвратить возможность возникновения внутренних факторов напряжённости.</p>
    `}]);return(_,s)=>(o(),a("div",null,[n(m,{class:"mt-25","speech-data":i.value,size:"large"},null,8,["speech-data"]),I,n(C,{items:t.value},null,8,["items"])]))}};export{F as default};
